**pandas GROUPBY**

In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['sam','charlie','amy','vanessa','carl','sarah'],
       'Sales':[200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

  Company   Person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [9]:
bycomp = df.groupby('Company')

In [10]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [12]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [13]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [15]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
df.groupby('Company').min()

          Person  Sales
Company
FB          carl    243
GOOG     charlie    120
MSFT         amy    124

In [20]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0